Sample SOAP Request XMLs/SupplierRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:tns="www.outoftheboxacademy.com">
    <soapenv:Header/>
    <soapenv:Body>
        <tns:SupplierRequest>
            <SupplierID>SUP-56789</SupplierID>
        </tns:SupplierRequest>
    </soapenv:Body>
</soapenv:Envelope>
